[
    {
      "Scene_ID": 35,
      "Title": "Casting Couch",
      "Full_Length": 1360,
      "Description": "And have you ever wanted to join the gay VR porn videos industry? Do you think that you have what it takes to become a sexy gay VR porn performer and to show your racy ass in front of the VRB Gay camera? We’re really picky and just having a sensual body might be not good enough to become one of our pros - you’re gonna need some skills, a lot of attitude and an open mind to join our gay VR porn elite. Our most recent discovery and a brand new face to the gay VR porn videos, Travis, has come a long way to join the best of the best, and we’re really happy that eventually it turned out that he’s viable of being one of us - luckily for you, our precious members, we’ve managed to record the Travis’ very first audition, giving you a brand new solo masturbation scene in virtual reality. In this solo gay VR porn video, the boy might look a little stressed at first, but with just a little patience you’ll get to watch him playing with a big-ass dildo in no time. He was prepared for this audition and his ass is all stretched and ready even for the biggest cock, so do not worry - his performance will be the world class for sure. We’re aware that Casting Coach gay VR porn movie is a fantasy for a lot of you, so it’s actually quite convenient that we could kill two birds with one stone, finding a brand new gay VR porn performer and shooting an immersive scene for you at the same time. It seems like Travis really wanted to get this job, and he’ll be going all in to both your and our delight, so neither should you hold yourself back - wear your VR headset straight away and enjoy this exclusive gay VR porn video in all its glory of 4K and full 360 degrees.",
      "Pornstars": [
        "Travis"
      ],
      "Tags": [
        "Twink",
        "Handjob",
        "Cumshot",
        "Solo",
        "Manscaping"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/casting-couch/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/casting-couch/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2018/05/Casting_Couch_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2018/05/Casting_Couch_poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2018/05/Casting_Couch_thumb_1_preview.jpeg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2018/05/Casting_Couch_thumb_2_preview.jpeg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2018/05/Casting_Couch_thumb_3_preview.jpeg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2018/05/Casting_Couch_thumb_4_preview.jpeg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2018/05/Casting_Couch_thumb_5_preview.jpeg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_casting_couch/VRBGAY_casting_couch_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_casting_couch/VRBGAY_casting_couch_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_casting_couch/VRBGAY_casting_couch_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:00"
    },
    {
      "Scene_ID": 114,
      "Title": "Special Delivery",
      "Full_Length": 1551,
      "Description": "When you ordered your special gift you never thought it would be brought to you by such a hot guy like Gabriel. But here he is with a nice box that has your name on it. Well, you are in the back of your lovely house so you don’t even get to answer the door for him. You’re just chilling and trying to relax and you don’t have the time to get to the door! So, Gabriel comes to the back door to give you your package and when you see him it is way more than you expect. Most of the time these delivery guys are dad bod jokers who toss the boxes and go but this guy is the real deal. He’s super hot and muscular and you see that your box is already opened. The delivery guy apologized but he says the box was opened already and he saw what you bought. Your face turns bright red because you did not want anyone to know about your taste for this hot stuff. However, you are kind of turned on when you realize that maybe Gabriel wants to get in on your dildo fun. Luckily for you Gabe wants to try out the toy and warm it up for you. He happens to think you’re pretty cute too so he tries it out and gets it good and lubed up before sticking it inside of his asshole. This is really just a warm up because he fully intends to get his ass fucked by you too. This is your lucky day because in addition to a brand new dildo you also got a bio cock to make you happy! Gabriel loves the fucking that you get him and he will request to be your delivery guy from now on.",
      "Pornstars": [
        "Gabriel D’Allessandro"
      ],
      "Tags": [
        "Big Dick",
        "Blowjob",
        "Outdoor",
        "Bareback",
        "Daddy",
        "Latino",
        "Cumshot",
        "Straight Guys",
        "Manscaping"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/special-delivery/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/special-delivery/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/Special_Delivery_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/Special_Delivery_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/Special_Delivery_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/Special_Delivery_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/Special_Delivery_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/Special_Delivery_thumb_5.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_special_delivery/VRBGAY_special_delivery_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_special_delivery/VRBGAY_special_delivery_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_special_delivery/VRBGAY_special_delivery_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:01"
    },
    {
      "Scene_ID": 200,
      "Title": "Horny Mornings",
      "Full_Length": 935,
      "Description": "Jeffrey Lloyd just woke up in the morning with a boner, pretty much like you. He went downstairs to get a cup of coffee, but the boner just isn't going away! You know why? Because his thinking of the great time he had with you last night, it just doesn't leave his head. Jeffrey can't hold it so he takes out his huge cock while drinking his cup of coffee, closes his eyes and simply starts jerking off while thinking of you. He's so horny, that he pounds his cock like a stroking machine going up and down, up and down, trying to make himself cum to remember last nights fuck in that bathroom bar. Jeffrey wants you to join him and watch him stroke out his anaconda while he wiggles it from side to side in this gay VR Porn video. Jeffrey also wants you to grab a cup of coffee and watch him stroke it right in front of you. He will show you his sexy six pack and slim body to get you going even more. Now, the moment we've all been waiting for, put on your VR headset because you'll get cum all over your face and body in 4K 3D Virtual Reality like you've never experienced before!!! Finally, you've both came at the same time and you can now go back to your office job with a happy smile on your face, but don't forget that you'll both be meeting at the club tonight, so save some sperm for that sexy hunk. For now, just wear your VR goggles - regardless you have the Oculus, GearVR, HTC Vive, PSVR, Daydream or a smartphone with Google Cardboard headset - and let the newest Gay VR Bangers scene suck you up, as it's one of the most immersive porn of all kinds.",
      "Pornstars": [
        "Jeffrey Lloyd"
      ],
      "Tags": [
        "Big Dick",
        "Hunk",
        "Twink",
        "Handjob",
        "Muscle",
        "Cumshot",
        "Solo"
      ],
      "FOV": [
        "180"
      ],
      "POV": "VOYEUR",
      "Video_URL": "https://vrbgay.com/video/horny-mornings/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/horny-mornings/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Horny-Mornings_box_cover.jpg",
      "Poster": "",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Horny-Mornings_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Horny-Mornings_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Horny-Mornings_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Horny-Mornings_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Horny-Mornings_thumb_5.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_horny_mornings/VRBGAY_horny_mornings_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_horny_mornings/VRBGAY_horny_mornings_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_horny_mornings/VRBGAY_horny_mornings_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 201,
      "Title": "Showing it Off",
      "Full_Length": 683,
      "Description": "Dom Ully is the kind of guy that you definitely want to know. He is super hot and to be honest and give you a bit of behind the scenes information he is a total dream to work with in person. Everyone around has a big crush on him because he is so charming and friendly, and he always has to fend off flirtations and people giving him their phone number when he comes here to shoot VR porn. That aside, here he is with his all American smile and hipster good looks to give you some solo attention. He shows off his washboard abs and slowly strips for the camera. He pulls down his pants and his cock pops out. It is quite a sight to see. He knows what to do with it to make you turned on and it is even better because it is in your virtual reality headset. This means that you will feel like you are right there with Mr. Ully while he rubs his cock and gives himself a session that includes things you usually only do in private places! Dom’s cock has got to be at least 8 inches long if not more. He jerks off and then he shows you his well used asshole which is a bit open at all times at this point. His cock gets so full and hot that he cums in a huge load all over his chest. It feels so good to be right there with him while he spews as he is staring straight at you through the camera. Find out what it would be like to be in the same room with Dom as he is masturbating and you will definitely feel that way no matter what VR headset you are using to view this unforgetting VR Porn Video.",
      "Pornstars": [
        "Dom Ully"
      ],
      "Tags": [
        "Hunk",
        "Twink",
        "Tattoos",
        "Handjob",
        "Cumshot",
        "Solo",
        "Manscaping"
      ],
      "FOV": [
        "180"
      ],
      "POV": "VOYEUR",
      "Video_URL": "https://vrbgay.com/video/showing-it-off/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/showing-it-off/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2017/10/Showing-it-Off_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2018/05/poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2017/10/Showing-it-Off_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2017/10/Showing-it-Off_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2017/10/Showing-it-Off_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2017/10/Showing-it-Off_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2017/10/Showing-it-Off_thumb_5.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_showing_it_off/VRBGAY_showing_it_off_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_showing_it_off/VRBGAY_showing_it_off_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_showing_it_off/VRBGAY_showing_it_off_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 203,
      "Title": "Addicted to Ass",
      "Full_Length": 1272,
      "Description": "Some addictions are not too good. They can cause you to do things that are out of character. But others are more appropriate. You might even say they are innocent and fun. This one is a perfectly fine one to have. In fact it is even encouraged. Jamie Oliver shows up for a photo shoot. Sure he expected that things would get kind of sexy but he didn’t know that things would turn so hot. His photographer started to take pics of him without his top on, but soon his pants get off and his underwear looks so hot. Soon the photographer starts coming on to him and he doesn’t mind. He has been kind of horny and lonely lately so he doesn’t mind finding a new lover! The photographer guides Jamie to his crotch and then his cock gets unleashed. Jamie is an expert at sucking dick so he gives it a go. His mouth easily wraps around the cock and he can even take the whole thing almost balls deep. The photographer wants more. He wants to get the whole picture of Jamie. So he turns Jamie around and fills his asshole with his nice cock. Jamie gets on it in a variety of different positions. He sits on top of it, and bends over to take it as well. You get to see this from the photographer’s perspective because this is a POV VR Porn video that looks so real because it is in the highest 4K Ultra HD quality for your virtual reality headset. If you have always wanted to spend a day with a guy as hot as Jamie then now is your chance! Otherwise you would have to hop on a plane to find Jamie in the Czech Republic, but here you can spend time with him in your own living room.",
      "Pornstars": [
        "Jamie Oliver"
      ],
      "Tags": [
        "Blowjob",
        "Hunk",
        "Twink",
        "Tattoos",
        "Bareback",
        "Handjob",
        "Cumshot",
        "Manscaping"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/addicted-to-ass/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/addicted-to-ass/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Addicted-to-Ass_box_cover.jpg",
      "Poster": "",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Addicted-to-Ass_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Addicted-to-Ass_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Addicted-to-Ass_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Addicted-to-Ass_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Addicted-to-Ass_thumb_5.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_addicted_to_ass/VRBGAY_addicted_to_ass_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_addicted_to_ass/VRBGAY_addicted_to_ass_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_addicted_to_ass/VRBGAY_addicted_to_ass_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 204,
      "Title": "Getting Serviced",
      "Full_Length": 1099,
      "Description": "Hottie Micah Brandt is a plumber who wants to do a good job. He is at your house trying really hard to fix your sink which just won’t stop spurting everywhere just like your cock does when you see a guy who is as hot as Micah. He is working so hard that he is practically sweating. He starts to get a bit angry at your sink because it’s just not working out, but he does the job and fixes the sink in the end. However, you have to report that you sadly don’t have any money to pay him, and you’re wondering if you can pay him in some other way. Well, it turns out that even though the job was so hard Micah has a crush on you and he doesn’t really care about the money as long as you will give him the opportunity to jerk off for you. That’s a unique form of payment wouldn’t you think? Micah whips out his dick which gets hard pretty easily even though he is all tuckered out from the job. Micah Brandt has a great dick and you can only imagine it going inside of you as he strokes it good and hard. Before you know it your dick is hard too on the other side of your virtual reality headset and you can stroke yourself along with Mr. Brandt to give yourself the orgasm of a lifetime. Imagine a gay sex star jerking it off right in the midst of your kitchen! What a great site to see. If you have been ready to try VR porn videos then this is one that will set you off and help you see how amazing this new genre of smut really is. It’s perfect for anyone who wants to see a hot gay guy jerking themselves off right in your own kitchen!",
      "Pornstars": [
        "Micah Brandt"
      ],
      "Tags": [
        "Big Dick",
        "Black",
        "Hunk",
        "Handjob",
        "Muscle",
        "Cumshot",
        "Solo",
        "Manscaping"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/getting-serviced/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/getting-serviced/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Getting-Serviced_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2018/07/poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Getting-Serviced_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Getting-Serviced_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Getting-Serviced_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Getting-Serviced_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Getting-Serviced_thumb_5.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_getting_serviced/VRBGAY_getting_serviced_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_getting_serviced/VRBGAY_getting_serviced_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_getting_serviced/VRBGAY_getting_serviced_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 205,
      "Title": "One on One",
      "Full_Length": 1033,
      "Description": "Wow you are a lucky guy. Ducati Trenton is your boyfriend. He is a hot guy who is something like 6 feet 1 inches of pure hunky goodness. He has some washboard abs and a nice sized cock that you love to reminisce about the things you want to do with it. Why are you reminiscing you may ask? Well, it’s because you are away on a business trip to far away Paris and you had to leave your hot lover behind. You miss him so but is it more so because you miss the hot sex or because you actually miss him. In either case, it doesn’t matter because Ducati is ready for you on video chat and he wants to show you what you are missing out on. As soon as the call begins he is hot and heavy just for you and he isn’t thinking about any other guys. He strips for the camera and then whips out his gem of a dick and makes it hard. He rubs it and rubs it, giving you a good solo show until you can’t wait to see the best part of the show - the part when he spurts his load. Of course this just makes you miss him more because you wish you could be together, but you will be again soon enough. Ducati is a great guy to watch in virtual reality and in this VR Porn Video. He is definitely the type of man you want to get up close to. He is so hot and he knows how to move over chat to make you happy and remind you of the hottest moments you have ever shared together. Through your VR headset Mr. Trenton makes you feel like you are the only guy in the room.",
      "Pornstars": [
        "Ducati Trenton"
      ],
      "Tags": [
        "Tattoos",
        "Handjob",
        "Muscle",
        "Daddy",
        "Cumshot",
        "Solo"
      ],
      "FOV": [
        "360"
      ],
      "POV": "VOYEUR",
      "Format": [
        "STEREO"
      ],
      "Video_URL": "https://vrbgay.com/video/one-on-one/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/one-on-one/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/One-on-One_box_cover.jpg",
      "Poster": "",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/One-on-One_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/One-on-One_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/One-on-One_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/One-on-One_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/One-on-One_thumb_5.jpg"
      },
      "Trailers": {
        "360_HQ": "https:https://mov.vrbgay.com/vrbgay_one_on_one/VRBGAY_one_on_one_trailer_HQ_3dv.mp4",
        "360_HD": "https:https://mov.vrbgay.com/vrbgay_one_on_one/VRBGAY_one_on_one_trailer_HD_3dv.mp4",
        "360_4K": "https:https://mov.vrbgay.com/vrbgay_one_on_one/VRBGAY_one_on_one_trailer_UHD_3dv.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 206,
      "Title": "Happy Bending",
      "Full_Length": 1703,
      "Description": "Wow. You’ve been feeling so stressed out lately, haven’t you? Hitting the gym hard, working all your muscles, and not giving yourself any release. Luckily you’ve decided to treat yourself to this massage. This masseur had some great reviews online and he is totally hot which you consider a major bonus. You show up to the place and get relaxed. Then the magic starts to happen. This rub down goes innocently enough at first, that is until your masseur notices that your cock is rock hard from all of this intimate attention. Your whole body is already lubed up with slick massage oil and once your masseur, the sexy Manuel Skye, notices that your dick is lifting up the towel he used to cover it modestly, he decides to include your cock in the pleasurable experience. That really gets you going as he lubes up your well seasoned fuck stick with the oil and it becomes a slippery playground of lubed up goodness. You find that you wish he would fuck you and stick your well lubed cock in his ass. Like he is reading your mind Manuel does just that, hopping on top of you to pleasure his prostate and asshole using your rod. You may wonder if Manuel does this with all of his massage clients and the answer is that he only does it with the ones that he likes who he thinks are cute! Watch this scene go down in completely beautiful and crisp 4K HD in your VR Headset whether you are using Google Cardboard, Gear VR, Playstation VR, Oculus, VIVE or Daydream, you will be quite happy with the result of this VR Porn Video! All you have to do is strap it on to you and make your sexual fantasies come true with a hot guy like Manuel at the ready for a good fucking!",
      "Pornstars": [
        "Manuel Skye"
      ],
      "Tags": [
        "Big Dick",
        "Blowjob",
        "Hunk",
        "Bareback",
        "Muscle",
        "Daddy",
        "Cumshot"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/happy-bending/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/happy-bending/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Happy-Bending_box_cover-1.jpg",
      "Poster": "",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Happy-Bending_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Happy-Bending_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Happy-Bending_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Happy-Bending_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Happy-Bending_thumb_5.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_happy_bending/VRBGAY_happy_bending_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_happy_bending/VRBGAY_happy_bending_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_happy_bending/VRBGAY_happy_bending_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 207,
      "Title": "Pool Boy Seduction",
      "Full_Length": 1541,
      "Description": "Logan Moore is the sexiest pool repair guy around. So he shouldn’t be surprised that when a client calls him up he comes onto him! His new client shows up to the door with a completely opened up robe, revealing his junk and body. Logan is surprised and thinks it’s kind of creepy but secretly he is just playing hard to get because he thinks that this guy is cute too! Logan does the pool job but when he is about to leave the boss offers him even more than he bargained for. So, Logan blows this guy who owns a pool in his beautiful house. He does a great job because he always pays attention to detail and makes sure to take care of everyone’s needs. He's master of deep-throating and can gag on the cock with ease to give a sloppy blowjob of your dreams. After sucking cock a bit he goes to leave again but this man doesn’t want to be left with a case of blue balls, so he offers Logan even more to finish the job the right way. Logan is more than happy to oblige and he offers up his asshole for a good hard fucking. It is what he has secretly been craving all day long but he doesn’t let that on, he just acts like this happens to him all the time and he knows that he is hot stuff. If you want to see what it is like to share a sexual experience with Logan Moore all you have to do is pick up your best VR headset, put it on, and load up the VR Porn video. The experience is so realistic you may forget where you are exactly and float off to a dreamland where Logan is servicing your every sexual need!",
      "Pornstars": [
        "Logan Moore"
      ],
      "Tags": [
        "Big Dick",
        "Blowjob",
        "Tattoos",
        "Bareback",
        "Handjob",
        "Muscle",
        "Daddy",
        "Bear",
        "Cumshot"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/pool-boy-seduction/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/pool-boy-seduction/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Pool-Boy-Seduction_box_cover.jpg",
      "Poster": "",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Pool-Boy-Seduction_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Pool-Boy-Seduction_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Pool-Boy-Seduction_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Pool-Boy-Seduction_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Pool-Boy-Seduction_thumb_5.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_pool_boy_seduction/VRBGAY_pool_boy_seduction_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_pool_boy_seduction/VRBGAY_pool_boy_seduction_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_pool_boy_seduction/VRBGAY_pool_boy_seduction_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 208,
      "Title": "Dr. Mecum",
      "Full_Length": 2160,
      "Description": "Everyone hates to go to the doctor, but if your doctor was Alex Mecum, you wouldn’t really hate it so dang much! This is every guy’s fantasy that Zander Cole, who plays the patient, thought of. He wanted to go to the doctor and have every inch of his orifices explored by a guy who knows how to open someone up. He chose Alex MeCum because he is such a hottie and he always envisioned him in the role of a naughty doctor. So picture this. You show up at your doctor’s office and Alex greets you. He tells you to relax but you’re a little bit nervous, because it’s been a while since you’ve been to the doctor. The examination starts like normal but things start to take a turn for the unusual. Perhaps the touches are a bit too intimate or there is a bit too long spent on the erogenous zones of the body. Then comes the anal examination. That is the best part of the exam that lets you know it is time to relax fully and open up to new sexual experiences. Alex exposes Zander and the two get into it with some seriously sexy action. There haven’t been two guys getting it on like this in a while. This pair has a great chemistry and it’s easy to see that they are truly gay guys who enjoy each other’s company. In fact when they came into the studio we learned they are friends in real life and they really like to shoot porn together, especially when it is in a creative scene like this one where they get to let loose and have a good time! Find out what kind of kinky fun these guys have together by strapping on your favored VR device and watching them in a great VR Porn video medical scene!",
      "Pornstars": [
        "Alex Mecum"
      ],
      "Tags": [
        "Big Dick",
        "Blowjob",
        "Muscle",
        "Daddy",
        "Cumshot"
      ],
      "FOV": [
        "360"
      ],
      "POV": "MALE",
      "Format": [
        "STEREO"
      ],
      "Video_URL": "https://vrbgay.com/video/dr-mecum/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/dr-mecum/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Dr.-Mecum_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2018/08/poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Dr.-Mecum_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Dr.-Mecum_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Dr.-Mecum_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Dr.-Mecum_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Dr.-Mecum_thumb_5.jpg"
      },
      "Trailers": {
        "360_HQ": "https:https://mov.vrbgay.com/vrbgay_dr_mecum/VRBGAY_dr_mecum_trailer_HQ_3dv.mp4",
        "360_HD": "https:https://mov.vrbgay.com/vrbgay_dr_mecum/VRBGAY_dr_mecum_trailer_HD_3dv.mp4",
        "360_4K": "https:https://mov.vrbgay.com/vrbgay_dr_mecum/VRBGAY_dr_mecum_trailer_UHD_3dv.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 209,
      "Title": "Booty Camp",
      "Full_Length": 1764,
      "Description": "Imagine you are the hot porn star Micah Brandt. You are camping with your butt buddy Zander Cole. You are all snuggled up close in your tent but you can’t rest because of all the noises of the woods that are keeping you up. Zander is up too and he is feeling quite frisky. Soon you feel his hands getting crawly all over you. You didn't expect a hot encounter but you sure are up for one with your sexy camp mate - who would say 'no' to such a hottie? He starts getting your big dick ready to go. He uses his hands and then his mouth to awaken the sexiness that lives inside of you at all times. Sure you agreed to go on a camping trip with Zander because you think he is cute but you never thought you would actually be able to get in a fuck with him. This is booty camp after all and this is one of the hot sex sessions of your life! Booty Camp is a great VR Porn movie starring two hot studs that you can see in Ultra 4K in your VR headset. It looks amazing on the HTC Vive, Oculus, or Daydream, and heck, it even looks perfect on budget friendly Google Cardboard, enjoy this VR Porn Video with any device that you have! You just plug your phone into it and then you will have access to some of the hottest gay sex that will make you feel like you are really watching it all happen live in front of your face. You will feel like you are in that tent with two major gay pornstars getting it on and what could be better than that! Just strap your headset onto your face, get your headphones on and get to fapping!",
      "Pornstars": [
        "Zander Cole"
      ],
      "Tags": [
        "Big Dick",
        "Blowjob",
        "Outdoor",
        "Hunk",
        "Muscle",
        "Latino",
        "Cumshot",
        "Manscaping"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/booty-camp/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/booty-camp/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Booty-Camp_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2017/10/poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Booty-Camp_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Booty-Camp_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Booty-Camp_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Booty-Camp_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2017/08/Booty-Camp_thumb_5.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_booty_camp/VRBGAY_booty_camp_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_booty_camp/VRBGAY_booty_camp_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_booty_camp/VRBGAY_booty_camp_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 210,
      "Title": "Total Exposure",
      "Full_Length": 1069,
      "Description": "Thomas Freidl is a hot muscled up beefy guy who spends all day at the gym working on his look just for you. He has abs on his abs and muscles in places that you never knew were possible. Today he is here just for you and he wants to lavish you with his undivided attention. So strap on your favorite virtual reality headset whether that is Oculus or HTC Vive and go watch this amazing man. He starts out in the shower where you can see him spraying down his big muscles. His skin turns red from the warm water and sends shivers up your own spine. He covers himself well with a sexy red towel so that he can dry off a little bit. The towel feels so good against his cock so that he starts to massage his big dick with it. Soon he can’t hide it any longer and he decides to forgo all other pretenses and shows off his whole body nude complete with his now raging hard erection. He shows off his asshole to you and then rolls over to show you what it looks like when he masturbates. This is an intimate session and Thomas is a guy who likes to share his energy with you. He is not just one of these dudes who is in the porn flicks for other reasons. His goals with VR porn are to give you as much pleasure as he is receiving. He jerks his stiff rod until he releases a huge load of sperm and splooge right onto his washboard abs. Thomas is happy to share this intimate moment with you in such close quarters! Mr. Freidl is a special kind of guy who really puts all of himself into a scene and you can tell from watching him in this 4K Ultra HD gay VR Porn video.",
      "Pornstars": [
        "Thomas Freidl"
      ],
      "Tags": [
        "Handjob",
        "Muscle",
        "Bear",
        "Cumshot",
        "Solo",
        "Straight Guys",
        "Manscaping"
      ],
      "FOV": [
        "180"
      ],
      "POV": "VOYEUR",
      "Video_URL": "https://vrbgay.com/video/total-exposure/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/total-exposure/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2017/10/Total-Exposure_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2017/10/poster-1.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2017/10/Total-Exposure_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2017/10/Total-Exposure_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2017/10/Total-Exposure_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2017/10/Total-Exposure_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2017/10/Total-Exposure_thumb_5.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_total_exposure/VRBGAY_total_exposure_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_total_exposure/VRBGAY_total_exposure_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_total_exposure/VRBGAY_total_exposure_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 211,
      "Title": "My Boyfriend's a Gamer",
      "Full_Length": 1360,
      "Description": "Wow you are a lucky guy. Your boyfriend is Dom Ully, a cool looking gay pornstar who is hot as heck. The only thing that you don't like about him is that he is such a gamer. You're not super into video games but luckily he doesn’t care so much about them that he ignores you all the time. When he sees that you’re not interested in the game he is playing right now he comes over to you as you are lying on the bed. He notices your boner and gets interested in you instead of his silly game. He knows how you get when you don’t have your sex...Soon he is unbuttoning your pants and unleashing your dick. He massages it with his gaming controller with a goofy grin on his face. He sure does know how to make you laugh and smile. Dom stick your thick rod into his face hole and sucks away. He knows you well and he knows what you like. He never slacks off when licking a rod and he does you good. Soon he takes off his shirt to reveal his hot tattoos that you love so much. Soon it is time for your to inspect Dom’s asshole before you plow your hard rod straight deep down into it. He sits on your fuck stick and moves around on top of it, making you realize just how much you lust after your boyfriend and you are so lucky. Dom knows how to give you pleasure and after you’ve used his ass well he gives both of you a handjob at the same time before returning to the more fucking fun. He really loves the sex you two have together and he looks straight at you through the virtual reality camera, letting you know how intimate he feels around you. He bends over and you fuck him while he is on his hands and knees. He knows his holes belong to you and only you which is why he loves to go into this submissive position to let you use him however you want. After a good solid pounding, you jizz all over his perfect back. This VR Porn Video is available in Ultra HD 4k in your virtual reality headset so you really feel like you are in the room when all of this is happening. You are the luckiest guy around!",
      "Pornstars": [
        "Dom Ully"
      ],
      "Tags": [
        "Blowjob",
        "Hunk",
        "Twink",
        "Tattoos",
        "Bareback",
        "Handjob",
        "Muscle",
        "Cumshot"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/my-boyfriends-a-gamer/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/my-boyfriends-a-gamer/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/My_Boyfriends_a_Gamer_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/poster-1.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/My_Boyfriends_a_Gamer_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/My_Boyfriends_a_Gamer_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/My_Boyfriends_a_Gamer_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/My_Boyfriends_a_Gamer_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/My_Boyfriends_a_Gamer_thumb_5.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_gamer_boyfriend/VRBGAY_gamer_boyfriend_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_gamer_boyfriend/VRBGAY_gamer_boyfriend_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_gamer_boyfriend/VRBGAY_gamer_boyfriend_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 212,
      "Title": "Draining my Muscle",
      "Full_Length": 1078,
      "Description": "Manuel Skye is a hot Latino guy who just can’t wait to go to the gym every day. He goes there all the time to make his muscles tired and to work on his body so that all of the guys will think he is hot stuff. Today he got back from the gym all tired and ready to chill out, but when he got home, he noticed something was amiss. His roommate was on his bed and acting kind of sly. Manuel always had kind of a crush on his roomie so he wasn’t too upset about it, but he wondered what his roommate had in mind. Well, Manuel decided to put on a sexy show for his roommate to show off what he did at the gym. First he starts out just showing off his muscles but then he gets into some sexy moves and shows you more than you bargained for, since you are in the seat of the erotic roommate. When he feels up to it, Manny starts to rub his nice thick rod for your viewing pleasure. He wants you to know what you’re missing out on as his roommate and how much he wants to fuck you someday. Of course he’s not ready to do that today so he just does a solo session, but you can get a preview of how sexy he is. Mr. Skye is about 5 feet 8 inches tall and has a nice thick cut body with a salt and pepper type of beard. He’s the kind of DILF you notice at the grocery store and then get an instant boner, and now here he is, rubbing one out right in front of you for your personal pleasure. You sure made the right decision when you signed the lease to move into this place!",
      "Pornstars": [
        "Manuel Skye"
      ],
      "Tags": [
        "Muscle",
        "Bear",
        "Cumshot"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/draining-my-muscle/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/draining-my-muscle/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/Draining_my_Muscle_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/poster-2.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/Draining_my_Muscle_thumb_1_preview.jpeg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/Draining_my_Muscle_thumb_2_preview.jpeg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/Draining_my_Muscle_thumb_3_preview.jpeg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/Draining_my_Muscle_thumb_4_preview.jpeg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/Draining_my_Muscle_thumb_5_preview.jpeg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_draining_my_muscle/VRBGAY_draining_my_muscle_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_draining_my_muscle/VRBGAY_draining_my_muscle_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_draining_my_muscle/VRBGAY_draining_my_muscle_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 213,
      "Title": "My Naughty Pool Boy",
      "Full_Length": 2040,
      "Description": "When you are rich everyone thinks you have it all figured out, but that’s not necessarily true. You know they say it is lonely at the top and that’s how you’ve been feeling lately. You sit alone in your big mansion all day, with no friends to come over and take care of you. That is, until Monday rolls around and your hot pool guy Mick Stallone comes over. He is one of the hottest male porn stars around and he loves dick like it’s going out of style. He comes over every Monday and comes over to clean your pool and take care of business. He walks around strutting his stuff, and when he comes in to get a glass of water he notices that you are there, stroking your dick, enjoying your palace, and enjoying the view. You have never fucked your pool boy but there is a first time for everything and today seems to be the day.He starts by stroking you and stripping all the way down, but soon your cock is buried deep in his throat and then he is sitting on your dick and fucking you. He shoves your cock into his ass and makes your fantasy come true. How many days have you thought about pounding his tight little hole but not had your ideas come to fruition? Today is your day to make your fantasies come true. Mick Stallone is a guy who is here to clean your pipes in more ways than one. It’s no wonder that you’ve been fantasizing about his 6 foot 1 inch tall frame that is the epitome of manliness. He is hot stuff and he knows how to work it to give you the maximum amount of sexual pleasure in virtual reality until you spew your load all over the place.",
      "Pornstars": [
        "Mick Stallone<-"
      ],
      "Tags": [
        "Blowjob",
        "Tattoos",
        "Bareback",
        "Latino",
        "Interracial",
        "Cumshot"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/my-naughty-pool-boy/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/my-naughty-pool-boy/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/My_Naughty_Pool_Boy_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/poster-3.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/My_Naughty_Pool_Boy_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/My_Naughty_Pool_Boy_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/My_Naughty_Pool_Boy_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/My_Naughty_Pool_Boy_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/My_Naughty_Pool_Boy_thumb_5.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_my_naughty_pool_boy/VRBGAY_my_naughty_pool_boy_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_my_naughty_pool_boy/VRBGAY_my_naughty_pool_boy_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_my_naughty_pool_boy/VRBGAY_my_naughty_pool_boy_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 214,
      "Title": "Oily Spills",
      "Full_Length": 975,
      "Description": "Logan Moore is one of the hottest gay pornstars today so it only makes sense that you would want to see him perform in some hot homosexual porn! This one is even better because it is a piece of virtual reality smut that will really get your gears going. He started out in his professional life as a dancer so he really knows how to move his body to get you to feel what he wants you to. Logan is hot and he is from the Netherlands meaning he has an accent that makes him even more charming. All of these factors explain why you would want to see this porn movie up close and personal in virtual reality. Logan gets all oiled up. He uses oil to show off his muscles and make him look even sexier than you even thought he could look. The oil drips down onto his cock and makes him all lubed up so that he can rub his fuck stick and make himself feel good, and in turn make you feel great. That’s what Logan lives for. His fans are everything for him and that’s why he wanted to do virtual reality videos. His 6 foot 1 inch tall frame squirms with desire as he sighs and groans as he works himself up to a climax. His rod gets harder and harder as he rubs it up and down, showing you just how he likes it. Before too long he explodes in a climax that lets out a release of splodge that will surprise you in its size, letting you know just how turned on he was. Logan is definitely the type of guy you want to get to know in a lubed up solo session. Find out what he has been hiding beneath his clothes by seeing him in this VR Porn video that will take you to your own wonderland and forget about your troubles!",
      "Pornstars": [
        "Logan Moore"
      ],
      "Tags": [
        "Big Dick",
        "Hunk",
        "Handjob",
        "Muscle",
        "Bear",
        "Cumshot",
        "Solo"
      ],
      "FOV": [
        "180"
      ],
      "POV": "VOYEUR",
      "Video_URL": "https://vrbgay.com/video/oily-spills/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/oily-spills/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/Oily_Spills_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/poster-4.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/Oily_Spills_thumb_1-1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/Oily_Spills_thumb_2-1.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/Oily_Spills_thumb_3-1.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/Oily_Spills_thumb_4-1.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/Oily_Spills_thumb_5-1.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_oily_spills/VRBGAY_oily_spills_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_oily_spills/VRBGAY_oily_spills_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_oily_spills/VRBGAY_oily_spills_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 216,
      "Title": "Stroking it Out",
      "Full_Length": 919,
      "Description": "Mick Stallone is one of the hottest pornstars around and it’s just your luck that he is actually your boyfriend. He is a busy guy who has to head out to work but he sees that you are a bit sad and lonely to be left all alone at home all day, so he stops to give you a treat and it is available for you to watch in your VR headset in ultra HD 4K. This is a top quality virtual reality solo masturbation video for anyone who wants to see a hot guy like Mick Stallone rubbing one out. It’s perfect for gay guys, bisexual dudes and ladies who want to watch such a thing. If you’ve never tried virtual reality porn before, this is a great place to start because it is simply one of the hottest masturbation scenes you will see and Mick is a guy who really knows how to put on a show. So Mick sits back and rubs his rod while you watch. When you are using your favored VR headset it really does appear that he is doing it just for you. You can imagine that this amazing pornstar is your real life boyfriend and when he’s not jerking it, that big fuck stick is going inside of your holes. What a thoughtful guy, giving you a nice sexy show before he goes and works out of the house all day. Just dream about what is going to happen that night when he gets back. Soon enough, Mick pops a big load right where you can see it so that you can enjoy the fruits of his labor. Now it is your turn to rub one out and show Mick what you are made of, until later on when the two of you will be together again in another VR Porn Video.",
      "Pornstars": [
        "Mick Stallone<-"
      ],
      "Tags": [
        "Hunk",
        "Latino",
        "Cumshot",
        "Solo"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/stroking-it-out/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/stroking-it-out/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/Stroking_it_Out_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2017/11/Stroking_it_Out_thumb_1_preview.jpeg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/Stroking_it_Out_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/Stroking_it_Out_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/Stroking_it_Out_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/Stroking_it_Out_thumb_5.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_stroking_it_out/VRBGAY_stroking_it_out_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_stroking_it_out/VRBGAY_stroking_it_out_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_stroking_it_out/VRBGAY_stroking_it_out_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 217,
      "Title": "The Tattoo Fucklist",
      "Full_Length": 2371,
      "Description": "Tattoos are so fucking hot, am I right? Sexy tribals, some oriental letters and signs, animals, people - possibilities are almost limitless! It's so wonderful that thanks to them you can decorate your body the way you want, by adding a keepsake, an important memory or something related to a loved person or place to it. The only problem with them is also their biggest plus - they’re permanent! Which means that if someone screws the job and decorates your skin with an ugly tattoo, you’re basically fucked up for life. It’s just like you’d have to pick one Gay VR Porn movie to watch until the end of your days - and what if you chose the wrong one?! There’s only one method to reduce the risk - you have to hire an expert who’ll never get it done wrong, so you can be sure that everything is gonna be alright. The only problem is that such guys are really hard to catch, because they’re so popular. Have you ever heard of a guy named Wesley Woods, though? He’s one of those artists, but also a Gay Virtual Reality Porn star - that’s an interesting combination, isn’t it? He’s being swarmed with fans and clients so his schedule is filled to the brim. But if you’re a famous person, he’ll surely find some extra time for you, because such stars can give him even bigger fame and, as a consequence, even more cash! But is it okay to ask for money from such a person? From someone you admire and cherish? It’d be so much better if you could... spend some quality time with such a person - or what’s even better, to watch someone doing it in as quality Gay VR Porn video from VR Bangers! So wear your VR goggles and view this exclusive production in 4K - if you’ll like it, maybe you’ll get yourself a tattoo, too?",
      "Pornstars": [
        "Wesley Woods"
      ],
      "Tags": [
        "Blowjob",
        "Hunk",
        "Tattoos",
        "Bareback",
        "Cumshot"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/the-tattoo-fucklist/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/the-tattoo-fucklist/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/The_Tattoo_Fucklist_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/The_Tattoo_Fucklist_poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/The_Tattoo_Fucklist_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/The_Tattoo_Fucklist_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/The_Tattoo_Fucklist_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/The_Tattoo_Fucklist_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/The_Tattoo_Fucklist_thumb_5.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_the_tattoo_fucklist/VRBGAY_the_tattoo_fucklist_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_the_tattoo_fucklist/VRBGAY_the_tattoo_fucklist_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_the_tattoo_fucklist/VRBGAY_the_tattoo_fucklist_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 218,
      "Title": "Desperate Housedudes",
      "Full_Length": 1913,
      "Description": "Relationships can get really hard, you know? Especially when there’s no equality between partners and one of them is giving more than taking. We know that sometimes life can get really tough and it’s hard to come up with the expectations, but on the other hand, it’s really easy to cross a thin line and start abusing someone’s help and trust. For example, imagine this scenario: you are like Jeremy Spreadums, a man who’s working his fingers to the bone every day, doing his best to pay the rent and support his beloved boyfriend, Arad Winwin, while he’s having a hard time to find a new profession. But one day, after coming home early to surprise your man, you find him watching the Gay VR Porn instead of looking for the new job! So you’re losing your mind, trying to make the ends meet and skipping the nights, while he’s just sitting there and fapping to some gay porn in virtual reality? Oh no, it’s about time to reverse the situation. This stupid fuck has to learn that he finally has to be responsible for his actions! And if he’s not going to work any soon, he’ll have to pay you back in nature - sucking your hard cock and chocking on it. So now you’re gonna fuck him so hard that he’ll forget about his Gay Virtual Reality Porn, and finally realize that his own partner can bang him better than any pornstar. If you’ll screw his anal hard, maybe his butt will hurt bad enough, so he will not be able to sit on his tight ass ever again, and maybe he’ll start searching for a job for once. Don’t worry, you’re not a leech like Arad, so you can watch this Gay VR Porn scene without any fear of being caught - in the end you’re a VR Bangers’ member which is in itself a proof of your value and quality!",
      "Pornstars": [
        "Jeremy Spreadums",
        "Arad Winwin"
      ],
      "Tags": [
        "Blowjob",
        "Hunk",
        "Tattoos",
        "Bareback",
        "Muscle",
        "Bear",
        "Latino",
        "Cumshot"
      ],
      "FOV": [
        "360"
      ],
      "POV": "MALE",
      "Format": [
        "STEREO"
      ],
      "Video_URL": "https://vrbgay.com/video/desperate-housedudes/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/desperate-housedudes/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/Desperate_Housedudes_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/Desperate_Housedudes_poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/Desperate_Housedudes_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/Desperate_Housedudes_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/Desperate_Housedudes_thumb_4.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/Desperate_Housedudes_thumb_3.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/Desperate_Housedudes_thumb_5.jpg"
      },
      "Trailers": {
        "360_HQ": "https:https://mov.vrbgay.com/vrbgay_desperate_housedudes/VRBGAY_desperate_housedudes_trailer_HQ_3dv.mp4",
        "360_HD": "https:https://mov.vrbgay.com/vrbgay_desperate_housedudes/VRBGAY_desperate_housedudes_trailer_HD_3dv.mp4",
        "360_4K": "https:https://mov.vrbgay.com/vrbgay_desperate_housedudes/VRBGAY_desperate_housedudes_trailer_UHD_3dv.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 219,
      "Title": "Art CL-ASS",
      "Full_Length": 1024,
      "Description": "They say that life is an art of drawing without an eraser - we’re not really sure what does it mean, but we’re certainly clear that the existence without the creation just wouldn’t be the same. Even though supposedly all of us are making art every day, by making food or literally taking a dump, there are some folks out there who can really squeeze something out of it. These artists are true actors, painters or even Gay VR Porn performers - and sometimes, they’re all of it combined, just like the handsome Wesley Woods! Wesley is a real man of Renaissance - he does a lot of things at once, while being good at all of them, and just like King Midas, he’s turning everything he touches into gold. The happier we are to work with him, since such character fits our exclusive Gay Virtual Reality Porn movies in 4K the best! Today he’s posing for some art class student naked, while giving him some tips about the painting at the same time. The artist is trying to draw his cock in details, but first he needs it to be nice and hard. Wesley is starting to play with his dick for the sake of art, giving himself and all the men watching him some hard boners - both the painter and all Wesley’s fans viewing him through their VR goggles. We all know that when the things get more intense, it’s really hard to stop, and it’s not different in this Gay VR Porn scene - when Wesley started having some fun, he won’t stop there and he’s going all in! Artist would’ve never suspected that this art class could end like this, and he’s as turned on as each and every one of us, watching this 4K scene in virtual reality. How will it end? Well, put your VR headset on and see for yourself!",
      "Pornstars": [
        "Wesley Woods"
      ],
      "Tags": [
        "Tattoos",
        "Cumshot",
        "Solo"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/art-cl-ass/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/art-cl-ass/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2018/01/Art_CL-ASS_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2018/01/Art_CL-ASS_poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2018/01/Art_CL-ASS_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2018/01/Art_CL-ASS_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2018/01/Art_CL-ASS_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2018/01/Art_CL-ASS_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2018/01/Art_CL-ASS_thumb_5.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_art_cl_ass/VRBGAY_art_cl_ass_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_art_cl_ass/VRBGAY_art_cl_ass_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_art_cl_ass/VRBGAY_art_cl_ass_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 220,
      "Title": "The Ultimate Hole",
      "Full_Length": 1806,
      "Description": "Are you a big fan of Olympic Games? This honorary event takes place every 4 years, uniting the hearts and eyes of millions of people watching the sportsmen live or on their TV screens. Today we present to you a super-sexy Gay VR Porn fantasy associated with this great contest, which should make both the sport and the quality sex scenes fans’ dreams come true - consider yourself lucky if you love both of these things at the same time! Hot Spanish model Pietro Duarte will become a figure skater for this one unique day only, who has just won some of the medals and is incredibly grateful to his professional coach played by an even hotter Aday Traun. This Gay Virtual Reality Porn scene will start off quite timidly, with Pietro stretching out his tight ass in front of the VR camera lens, yet it will get a lot of spice right after the boy starts paying attention to his qualified trainer. After a short conversation, this potentially inconspicuous talk will change into a real Gay VR Porn fantasy, with both of the hot guys fucking themselves and polishing each other’s schlongs. Pietro is very grateful to Aday, and he honestly thinks that he too deserved some kind of a prize, and that is exactly why he will go way beyond his limits in this immersive Gay VR Porn film. You can count on some sloppy face fucking, some tight asses being extended to their limits and even more hot moans spreading around the dressing room, when both males will be getting closer to cum in this enormous ecstasy. Both of the boys are really muscular and durable, so you can expect this performance to last for many long minutes, as the demanding coach will not get satisfied easily. Wear your VR goggles and join them in this amazing Gay VR Porn fantasy here and now!",
      "Pornstars": [
        "Pietro Duarte",
        "Aday Traun"
      ],
      "Tags": [
        "Blowjob",
        "Hunk",
        "Tattoos",
        "Bareback",
        "Muscle",
        "Latino",
        "Cumshot"
      ],
      "FOV": [
        "180"
      ],
      "POV": "VOYEUR",
      "Video_URL": "https://vrbgay.com/video/the-ultimate-hole/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/the-ultimate-hole/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2018/01/The_Ultimate_Hole_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2018/01/The_Ultimate_Hole_poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2018/01/The_Ultimate_Hole_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2018/01/The_Ultimate_Hole_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2018/01/The_Ultimate_Hole_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2018/01/The_Ultimate_Hole_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2018/01/The_Ultimate_Hole_thumb_5.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_the_ultimate_hole/VRBGAY_the_ultimate_hole_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_the_ultimate_hole/VRBGAY_the_ultimate_hole_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_the_ultimate_hole/VRBGAY_the_ultimate_hole_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 221,
      "Title": "My Secret Valentine",
      "Full_Length": 1578,
      "Description": "Do you often celebrate Valentine’s Day with your boyfriend? In this time of the year everyone is getting a fever of some sort, trying to express their feelings and emotions deeply hidden for the rest of the time. As Gay VR Bangers always try to surprise and satisfy their fans with the most fitting and suitable content available, we had to eventually prepare a Valentine’s themed Gay VR Porn movie, so you are probably not surprised that this movie has shown up - but since this time of the year is quite intensive and unique, this scene could not be a vanilla one either, and had to offer something extra. And do we have any BDSM fans over here? This may not be a gay version of Fifty Shades of Gray, but it too should give you a lot of strong impressions and hardcore experiences - especially that it has been recorded in 3D 360 and 4K resolution. To spice things up a little, we have decided to make it a threesome Gay Virtual Reality Porn video, adding some extra content to the regular amount of sex that we offer in most of our productions. In this Gay VR Porn fantasy, Aday Traun, Fabio and Pietro Duarte will have some fun with you, giving you a very immersive encounter that you will not forget quickly. Today Fabio will become your stepdad who has done everything to make these Valentine’s special for you, as he invited your high-school crush, Pietro, who will now do everything to have some fun together with you, and make up for all these years when you two have been apart. What is Aday doing, them? He is simply borrowing you his pair of eyes and his sexy body, as this immersive Gay VR Porn film otherwise could not happen, giving all of the Gay VR Bangers’ fans the experience that they have always been looking for online. Watch this amazing fantasy and fall in love with our performers on the occasion of Valentine’s Day!",
      "Pornstars": [
        "Fabio",
        "Pietro Duarte",
        "Aday Traun"
      ],
      "Tags": [
        "Big Dick",
        "Blowjob",
        "Threesome",
        "Orgy",
        "Hunk",
        "Tattoos",
        "Muscle",
        "Bear",
        "Latino",
        "Cumshot",
        "Group"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/my-secret-valentine/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/my-secret-valentine/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2018/02/My_secret_Valentine_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2018/02/My_secret_Valentine_poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2018/02/My_secret_Valentine_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2018/02/My_secret_Valentine_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2018/02/My_secret_Valentine_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2018/02/My_secret_Valentine_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2018/02/My_secret_Valentine_thumb_5.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_my_secret_valentine/VRBGAY_my_secret_valentine_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_my_secret_valentine/VRBGAY_my_secret_valentine_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_my_secret_valentine/VRBGAY_my_secret_valentine_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 222,
      "Title": "Last Man Standing",
      "Full_Length": 2582,
      "Description": "Are you a fan of martial arts, boxing, MMA or anything else that is directly connected with legally kicking someone else’s ass? These are the most masculine of all sport disciplines, and it was only a matter of time for us to create a Gay VR Porn fantasy related to them. Blood, sweat, tight shorts and adrenaline is the best combination that a horny man could ask for, so once again, going straight for your sophisticated demands, we present to you the Last Man Standing Gay VR Porn movie with two hot bareback males. The scenario is pretty straightforward: You’ll get to become an experienced boxer who’s just finished his training and is chilling out in the locker room. It was supposed to be an end of your struggles for today, and you were just about to give your muscles some rest, but since this is a Gay Virtual Reality Porn video, your peace had to be broken - yet you’re not gonna regret that, trust us. From the first moment when sexy Micah Brandt had entered the room, he kept staring at you and asking some questions to start a conversation and most likely pick you up. You’ve seen him watching you in the middle of your sparing, and you are well aware that he wants to fuck you. Well, today is your (and his) lucky day, since this is exactly what’s going to happen, and in a matter of minutes Micah will be already kneeling before you and sucking on your swollen dick. You’re gonna get your cock and balls sucked, and you will be given a unique opportunity of fucking Micah’s ass in the virtual reality. Wear your VR goggles straight away and join him in this unbelievably real Gay VR Porn fantasy in 4K and 360 degrees - with VRB Gay this could be the best training of your life!",
      "Pornstars": [
        "Micah Brandt"
      ],
      "Tags": [
        "Black",
        "Blowjob",
        "Hunk",
        "Bareback",
        "Muscle",
        "Interracial",
        "Cumshot"
      ],
      "FOV": [
        "360"
      ],
      "POV": "MALE",
      "Format": [
        "STEREO"
      ],
      "Video_URL": "https://vrbgay.com/video/last-man-standing/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/last-man-standing/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2018/02/Last_Man_Standing_box_cover-1.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2018/02/Last_Man_Standing_poster-1.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2018/02/Last_Man_Standing_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2018/02/Last_Man_Standing_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2018/02/Last_Man_Standing_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2018/02/Last_Man_Standing_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2018/02/Last_Man_Standing_thumb_5.jpg"
      },
      "Trailers": {
        "360_HQ": "https:https://mov.vrbgay.com/vrbgay_last_man_standing/VRBGAY_last_man_standing_trailer_HQ_3dv.mp4",
        "360_HD": "https:https://mov.vrbgay.com/vrbgay_last_man_standing/VRBGAY_last_man_standing_trailer_HD_3dv.mp4",
        "360_4K": "https:https://mov.vrbgay.com/vrbgay_last_man_standing/VRBGAY_last_man_standing_trailer_UHD_3dv.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 223,
      "Title": "Meet the Barber",
      "Full_Length": 2680,
      "Description": "We all have to visit a barber from time to time, yet even though sitting in a chair for couple of hours (beauty has its price, gentlemen) isn’t too pleasant, in Gay VR Porn movies everything can get really enjoyable when done in an appropriate company. For example, try to imagine that your barber is no other than a sexy Dominic Pacifico who you’ve been watching in his Gay VR Porn videos. How could such a handsome man and a pornstar become a simple hairdresser? Well, in the world of Gay VR Porn films everything is possible, so wear your VR goggles and enjoy this immersive scene - and stop asking silly questions! DJ Pacifico had seen you in one of the gay clubs and he knows that he is dealing with one of his fans, so sit in the chair nicely and, if you are lucky, you can count on some extra services. Touch of Dominic’s fingers on your head had already made you horny, but when he accidentally dropped the scissors and had to bend to pick them up, you couldn’t hold it back anymore and got hard in your pants - and yes, Dom’s noticed it! And what could possibly happen in such a situation? Well, he could else kick you out, or else suck your dick to help you with your enlarging problem, and since it’s your lucky day and this is a Gay VR Porn movie, you probably know which option has happened. Wear your VR goggles tight and sit back in your chair just like our model is sitting before the Dominic’s slutty lips, and enjoy this immersive Gay VR Porn fantasy in 4K - visiting a barber can’t really get any better, so you will be probably keep coming back to this movie every time when about to have a haircut.",
      "Pornstars": [
        "Dominic Pacifico"
      ],
      "Tags": [
        "Big Dick",
        "Hunk",
        "Tattoos",
        "Bareback",
        "Muscle",
        "Daddy",
        "Latino",
        "Cumshot"
      ],
      "FOV": [
        "360"
      ],
      "POV": "MALE",
      "Format": [
        "STEREO"
      ],
      "Video_URL": "https://vrbgay.com/video/meet-the-barber/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/meet-the-barber/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2018/03/Meet_the_Barber_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2018/03/Meet_the_Barber_poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2018/03/Meet_the_Barber_thumb_1_preview.jpeg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2018/03/Meet_the_Barber_thumb_2_preview.jpeg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2018/03/Meet_the_Barber_thumb_3_preview.jpeg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2018/03/Meet_the_Barber_thumb_4_preview.jpeg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2018/03/Meet_the_Barber_thumb_5_preview.jpeg"
      },
      "Trailers": {
        "360_HQ": "https:https://mov.vrbgay.com/vrbgay_meet_the_barber/VRBGAY_meet_the_barber_trailer_HQ_3dv.mp4",
        "360_HD": "https:https://mov.vrbgay.com/vrbgay_meet_the_barber/VRBGAY_meet_the_barber_trailer_HD_3dv.mp4",
        "360_4K": "https:https://mov.vrbgay.com/vrbgay_meet_the_barber/VRBGAY_meet_the_barber_trailer_UHD_3dv.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 224,
      "Title": "Interrogating Sex Detective",
      "Full_Length": 2405,
      "Description": "Gay VR Bangers are always trying to satisfy every need of their gay audience, endlessly coming up with some new ideas for their gay VR porn fantasies. If you’re watching us regularly, you’ve probably already seen our ideas being implemented, as there’s a lot of gay virtual reality porn movies to choose from. We’ve had the gym scenario, some gay VR porn films made at the poolside, and even some hospital-related fantasies made to the delight of our demanding fans. It was about time for us to make a jail bareback gay VR porn video, as being interrogated by a bad cop is a fantasia that almost all of us had at some point of our lives. Today, in the >>Interrogating Sex Detective<< gay VR porn movie, you will get to become a sheriff of this town, and it’ll depend on you how the justice will be served. Your prisoner, sexy Eddy CeeTee will do anything and everything to escape the prison, as he’s on the death sentence and the judge just won’t listen that he’s not guilty. Maybe if he’ll behave accordingly and make your time worth, you’ll be a little gracious and forget to keep paying attention on your cell key for few seconds, but first... Wear your VR headset and become a judge and the executor in this gay VR porn fantasy, as it’s completely up to you if Eddy will be freed today or not. He’ll do his best, but since you’re one of the Gay VR Bangers’ fans, which means that you’re very demanding, it may not be enough and you’ll need this sexy model to go even further and exceed his sexual limits to satisfy you. What does that mean? Dive into this gay virtual reality porn scene and find out by yourself - Eddy is waiting for you already, and since he really wants to be released, feel free to not holding yourself back and be pressing more than ever before.",
      "Pornstars": [
        "Eddy Ceetee"
      ],
      "Tags": [
        "Blowjob",
        "Threesome",
        "Bareback",
        "Muscle",
        "Cumshot"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/interrogating-sex-detective/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/interrogating-sex-detective/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2018/03/Interrogating_Sex_Detective_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2018/03/Interrogating_Sex_Detective_poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2018/03/Interrogating_Sex_Detective_thumb_1_preview.jpeg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2018/03/Interrogating_Sex_Detective_thumb_2_preview.jpeg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2018/03/Interrogating_Sex_Detective_thumb_3_preview.jpeg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2018/03/Interrogating_Sex_Detective_thumb_4_preview.jpeg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2018/03/Interrogating_Sex_Detective_thumb_5_preview.jpeg",
        "Image6": "https://cdn.vrbgay.com/wp-content/uploads/2018/07/Interrogating_Sex_Detective_thumb_1.jpg",
        "Image7": "https://cdn.vrbgay.com/wp-content/uploads/2018/07/Interrogating_Sex_Detective_thumb_2.jpg",
        "Image8": "https://cdn.vrbgay.com/wp-content/uploads/2018/07/Interrogating_Sex_Detective_thumb_3.jpg",
        "Image9": "https://cdn.vrbgay.com/wp-content/uploads/2018/07/Interrogating_Sex_Detective_thumb_4.jpg",
        "Image10": "https://cdn.vrbgay.com/wp-content/uploads/2018/07/Interrogating_Sex_Detective_thumb_5.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_interrogating_sex_detective/VRBGAY_interrogating_sex_detective_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_interrogating_sex_detective/VRBGAY_interrogating_sex_detective_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_interrogating_sex_detective/VRBGAY_interrogating_sex_detective_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 225,
      "Title": "Cock N Roll",
      "Full_Length": 993,
      "Description": "Another day and another solo masturbation scene with VR Bangers. Today we have got you covered with some dirty web-cam show with one of the most badass of our Gay VR Porn performers. Aday Traun will be here for you to give you a nice and slow introduction to his amazing male body, while talking dirty to all of our exclusive members. He is the bad boy that you’ve always had a crush on, so you can’t expect of him to be a nice guy, and this will be a rough ride - we guarantee! There will be some fapping, some playing with Aday’s tight anal and some dirty looks that should make you fall in love with him. We always try to make our solo masturbation scenes as personal as possible, giving you the highest level of the immersion and some memories that you will never forget. This buffed up thug will make your blood flow faster, when looking directly in your eyes, while playing with his cock at the same time. He is handsome, muscular and really horny, so recording this Gay Virtual Reality Porn video was really easy, as he was the one asking us to make it happen as fast as possible. Thankfully Aday is a natural talent and creating some Gay VR Porn movies with him was like a piece of cake, and we can only hope to keep making such films together in the future. If you liked Aday in his previous scenes, you will fall in love with him in this one, as it is as personal as it will ever get in the Internet - Gay Virtual Reality Porn videos in 3D 360 are the best ones around, especially since we have attained the 4K resolution when trying to reach the perfection. Join Aday now and have some fun with him - we promise that you will love it!",
      "Pornstars": [
        "Aday Traun"
      ],
      "Tags": [
        "Big Dick",
        "Tattoos",
        "Handjob",
        "Muscle",
        "Daddy",
        "Cumshot",
        "Solo",
        "Straight Guys"
      ],
      "FOV": [
        "180"
      ],
      "POV": "VOYEUR",
      "Video_URL": "https://vrbgay.com/video/cock-n-roll/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/cock-n-roll/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2018/04/Cock_N_Roll_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2018/04/Cock_N_Roll_poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2018/04/Cock_N_Roll_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2018/04/Cock_N_Roll_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2018/04/Cock_N_Roll_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2018/04/Cock_N_Roll_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2018/04/Cock_N_Roll_thumb_5.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_cock_n_roll/VRBGAY_cock_n_roll_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_cock_n_roll/VRBGAY_cock_n_roll_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_cock_n_roll/VRBGAY_cock_n_roll_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 226,
      "Title": "Are You Spy",
      "Full_Length": 1805,
      "Description": "Have you ever wanted to be a spy? You could, just like a handsome James Bond, run a dangerous life and be going on some difficult missions for the glory of your homeland - the only difference would be that you wouldn’t be scoring some sluts like James did, banging some hot gay dudes instead. This exciting life seems perfect - yet it has a one major drawback: what happens if you’ll get caught? You’ll soon find out in this immersive scene - Russian Spy gay VR porn video! The idea is quite simple and straightforward - or at least it may seem like that at the very beginning of this sex movie. You’ll get to watch some Russian spy (played by our brand new gay VR porn starlet, Travis), who’s unfortunately got caught in the middle of his dangerous mission and now is being interrogated by one of the most hardcore examinators in the world. Since Travis is tough and some regular methods simply won’t work, the bad guy will have to use more unconventional ones and treat him like a little bitch that he’ll become in this gay VR porn fantasy. If you’re a fan of some BDSM-related action, you should simply love our newest gay production, as in here you won’t experience anything that’s even close to being gentle. Travis will get to choke on a hard interrogator’s cock, to later have his ass raped by his dick covered with his own saliva. This toys gay VR porn video will only get better, when some huge dildos will come in use - even though Travis’ anal is wide and prepared, there are some things that might be too big to be withstand even by him. Have we got your attention? Good! So wear your VR goggles straight away and jump into this immersive gay VR porn video to have some fan with the obedient Travis!",
      "Pornstars": [
        "Travis"
      ],
      "Tags": [
        "Blowjob",
        "Twink",
        "Bareback",
        "Cumshot",
        "Manscaping"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/are-you-spy/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/are-you-spy/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2018/04/Are_You_a_Spy_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2018/04/Are_You_Spy_poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2018/03/Are_You_Spy_thumb_1_preview.jpeg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2018/03/Are_You_Spy_thumb_2_preview.jpeg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2018/03/Are_You_Spy_thumb_3_preview.jpeg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2018/03/Are_You_Spy_thumb_4_preview.jpeg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2018/03/Are_You_Spy_thumb_5_preview.jpeg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_are_you_spy/VRBGAY_are_you_spy_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_are_you_spy/VRBGAY_are_you_spy_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_are_you_spy/VRBGAY_are_you_spy_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 227,
      "Title": "Made in Italy",
      "Full_Length": 1465,
      "Description": "Did you like Fabio in his very first Gay VR Porn movie made together with VR Bangers? Well, we could not make you wait for his next performance any longer, so we have decided to prepare yet another movie with him, but this time it will be just you wearing your VR goggles and him in the solo masturbation scene of the highest quality. Since we have taken so much time to master the way that we are recording, and have managed to create this Gay VR Porn fantasy in 4K ultra high definition and 360 degrees of 3D resolution, this fantasia could not get any more personal and immersive, so if you were looking for such a movie to watch, we have got you covered! We know that lots of our fans do actually love such productions, as only in them they can feel like they have really been inside of our Gay VR Porn scenes, so from time to time we just love to get personal with one of our performers and shoot something like this one-on-one film. On the set there is only us, our virtual reality camera and the talent of our actor, making it all a lot more erotic and direct. Fabio is an open-minded person with a lot of precious skills, that’ll fit perfectly in here and it was a pleasure of working with him when recording this Gay VR Porn film. We made sure that our virtual reality lens have caught Fabio’s sexy body at every possible angle, giving you a very full experience that should cover up all your needs and desires. Today he will be doing a sexy show for his friend, showing off his spectacular jerking off skills - you too will have an opportunity to join this dream boy in this Gay Virtual Reality Porn movie, and become a one with him when both of you will be holding your hard dicks in your hands.",
      "Pornstars": [
        "Fabio"
      ],
      "Tags": [
        "Hunk",
        "Tattoos",
        "Handjob",
        "Muscle",
        "Latino",
        "Cumshot",
        "Solo",
        "Manscaping"
      ],
      "FOV": [
        "180"
      ],
      "POV": "VOYEUR",
      "Video_URL": "https://vrbgay.com/video/made-in-italy/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/made-in-italy/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2018/04/Made_in_Italy_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2018/04/Made_in_Italy_poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2018/04/Made_in_Italy_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2018/04/Made_in_Italy_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2018/04/Made_in_Italy_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2018/04/Made_in_Italy_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2018/04/Made_in_Italy_thumb_5.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_made_in_italy/VRBGAY_made_in_italy_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_made_in_italy/VRBGAY_made_in_italy_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_made_in_italy/VRBGAY_made_in_italy_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-03 02:56:08"
    },
    {
      "Scene_ID": 282,
      "Title": "More than Friends",
      "Full_Length": 1032,
      "Description": "Did you ever have a crush on a guy you were friends with and wish that things could be taken to the more than friends level? Well this is about to be your fantasy brought to life. Ronny Dark, a hot pornstar, has had a big crush on you for a while and he finally decides to take things to the next level and you definitely do not have any problem with it. Of course you would let a hot guy like Ronny take control and unbutton your pants slowly, teasing your cock all the way. Then he slowly sucks your dick, making it get super hard and full of lust for his tight asshole. The way that Mr. Dark stares at you lets you know that his feelings are real and he wants to take you all the way through this sexual experience until you jizz. You and Ron get naked and he sucks your dick more before he sits down right on top of your cock. You fill him up so much that he moans and his cock gets harder than ever before. He sits on you and jerks himself off so that he clenches around you. He gets you to jizz by giving you a handjob and then he pounds your ass until he is ready to unleash his cum and adds it to your pile of jizz that still lays on your chest. This is one of the hottest experiences you have ever had and the chemistry between you and Ronny is undeniable. Of course you’ve had a crush on him too and the feeling is mutual. Find out what all the talk about VR porn videos is all about. This is one scene where the connection is real and you will feel it through your virtual reality headset. You will know what it is like to spend an afternoon with a hot pornstar lavishing you with all of his attention!",
      "Pornstars": [
        "Ronny Dark"
      ],
      "Tags": [
        "Blowjob",
        "Hunk",
        "Bareback",
        "Handjob",
        "Muscle",
        "Cumshot",
        "Manscaping"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/more-than-friends/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/more-than-friends/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2017/10/More_than_Friends_box_cover.jpg",
      "Poster": "",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2017/10/More_than_Friends_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2017/10/More_than_Friends_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2017/10/More_than_Friends_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2017/10/More_than_Friends_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2017/10/More_than_Friends_thumb_5.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_more_than_friends/VRBGAY_more_than_friends_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_more_than_friends/VRBGAY_more_than_friends_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_more_than_friends/VRBGAY_more_than_friends_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2018-07-27 01:40:17"
    },
    {
      "Scene_ID": 347,
      "Title": "Hangover",
      "Full_Length": 1132,
      "Description": "You know those nights where you just go out and go to hard, and then you feel awful the next day. You stayed up too late and now you have to pay the price. There are many cures by people who claim they really know what they are talking about like eating sushi, drinking water or going back to sleep, but pornstar Jeffrey Lloyd knows that the only real cure for feeling tired and out of sorts is to get laid and have a good time to make you forget about your nasty feelings. Of course you will want to shower and brush your teeth first because you’ll probably be a bit fuzzy everywhere! Luckily you are there with him and Jeffrey takes off your pants without even getting out of bed. This is top quality pornstar service you are receiving - lucky you! He begins to suck you off while looking straight at you and soon he is also grinding your cocks together. Jeffrey knows that what you both need in order to feel better is to fuck you in the ass so he orders you to lift your legs and he inserts his beautiful cock into your backdoor. You already feel a whole lot better. It’s then that you take a turn at fucking your hot boyfriend’s asshole. You get him from every direction - below, above and behind. There’s practically no position that you leave unturned. Before long both of you are having a screaming orgasm with plenty of jizz that spews all over. This is a special moment for you and your lover and it really does cure a whole lot of ills. Now you are completely better and ready to start your day with amazing memories of your sexy morning with your boo in In this VR Porn Video.",
      "Pornstars": [
        "Jeffrey Lloyd"
      ],
      "Tags": [
        "Blowjob",
        "Hunk",
        "Bareback",
        "Cumshot"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/the-hangover/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/the-hangover/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/The_Hangover_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/The_Hangover_poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/The_Hangover_thumb_1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/The_Hangover_thumb_2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/The_Hangover_thumb_3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/The_Hangover_thumb_4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2017/12/The_Hangover_thumb_5.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_hangover/VRBGAY_hangover_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_hangover/VRBGAY_hangover_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_hangover/VRBGAY_hangover_trailer_UHD_180x180_3dh.mp4"
      },
      "Release_Date": "2019-02-11 09:00:09"
    },
    {
      "Scene_ID": 367,
      "Title": "Summertime Love",
      "Full_Length": 1632,
      "Description": "There is no better time to fall in love than summer, right? If you will only open yourself to all of these experiences, you can almost taste that erotica in the summer air - VR Bangers Gay are well familiar with that effect, thus our newest gay VR porn scene will promote that phenomena with not one but two sensual and incredibly handsome gay VR porn stars. Summertime Love gay VR porn video with Logan Moore and Darius Ferdynand - two wonderful, professional gay VR porn performers - will introduce you to that amazing summer atmosphere that accompanies us, professional gay VR porn movies’ makers, pretty much for the entire year - and now we are sharing these horny vibes with you inside our latest gay virtual reality porn scene of 4K ultra high definition! Our two handsome chunks equipped with all these muscle and their enormous dicks will be waiting for your appearance impatiently - they were just about to play a little with each other’s cocks and, believe it or not, but they could certainly use a hand (and a dick) of a guy like you. The more hands willing to work, the better, and since our two alluring gay VR porn performers are extremely determined to bring the sexual satisfaction to everyone who will be willing to participate in this brand new gay VR porn scene, you should probably wear your VR headset as soon as possible and join them straight away. Your ass, your eyes and your schlong - they should all be all-satisfied after watching this premium gay VR porn video, and whether you prefer Logan or Darius, both of these hot bears will pay enough of their attention to you and you will be definitely treated as a VIP member of gay VR porn society - as in every other gay VR porn scene from VR Bangers Gay!",
      "Pornstars": [
        "Logan Moore",
        "Darius Ferdynand"
      ],
      "Tags": [
        "Big Dick",
        "Blowjob",
        "Hunk",
        "Bareback",
        "Muscle",
        "Cumshot",
        "Manscaping"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/summertime-love/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/summertime-love/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2019/04/Summertime_Love_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2019/04/Summertime_Love_poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2019/04/Tutti_frutti_vrbgay-1-791x1024.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2019/04/Tutti_frutti_vrbgay-2-1024x1024.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2019/04/Tutti_frutti_vrbgay-3-1024x683.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2019/04/Tutti_frutti_vrbgay-4-791x1024.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2019/04/Tutti_frutti_vrbgay-5-1024x683.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_summertime_love/VRBGAY_summertime_love_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_summertime_love/VRBGAY_summertime_love_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_summertime_love/VRBGAY_summertime_love_trailer_4K_180x180_3dh.mp4"
      },
      "Release_Date": "2019-04-04 02:10:02"
    },
    {
      "Scene_ID": 381,
      "Title": "Well-earned Celebration",
      "Full_Length": 1682,
      "Description": "Have you achieved anything important lately? Yes? That is great - we should definitely celebrate that! And you know what? Even if you did not, VR Bangers Gay are here to cherish the fact that you are one of the members of our gay VR porn family - and that is exactly why we have just prepared this latest gay VR porn scene called the Well-earned Celebration. Inside of this gay virtual reality porn movie, you will get to watch two of our handsome gay VR porn hunks - James Castle and Lucas Fox - in their sensual celebration recorded with use of our sophisticated gay virtual reality porn camera. They guys have decided to spend the afternoon right next to the VRB Gay’s pool and they are inviting you to join the fun with them all the way - regardless of whether you have something important to celebrate or not, you should definitely join them as soon as possible and simply become a part of this steamy and all-wet gay VR porn fantasy. Both of their bodies are all slippery and humid, so you will not have any problems if you would like to fuck one of their asses with your dick - and if, on the other hand, are hungry for their cocks, just stick your anal into their direction and make them butt-fuck you instead! Both of these professional gay VR porn stars are determined to spend this day together with you, so wearing your VR goggles is the last thing that is keeping you away from joining their well-earned fun - VR Bangers Gay recorded this newest gay VR porn film in 4K ultra high definition and full 3D 360 degrees, so you will be able to almost literally feel like you were there with them, and today’s celebration should be the most enjoyable in your entire life!",
      "Pornstars": [
        "James Castle"
      ],
      "Tags": [
        "Blowjob",
        "Outdoor",
        "Hunk",
        "Tattoos",
        "Bareback",
        "Muscle",
        "Cumshot"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/well-earned-celebration/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/well-earned-celebration/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2019/04/Well-earned_Celebration_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2019/04/Well-earned_Celebration_poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2019/04/Lets_Celebrate_vrbgay-1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2019/04/Lets_Celebrate_vrbgay-2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2019/04/Lets_Celebrate_vrbgay-3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2019/04/Lets_Celebrate_vrbgay-4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2019/04/Well-earned_Celebration_blog.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_well_earned_celebration/VRBGAY_well_earned_celebration_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_well_earned_celebration/VRBGAY_well_earned_celebration_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_well_earned_celebration/VRBGAY_well_earned_celebration_trailer_4K_180x180_3dh.mp4"
      },
      "Release_Date": "2019-04-18 01:10:02"
    },
    {
      "Scene_ID": 388,
      "Title": "One Night Stand",
      "Full_Length": 1244,
      "Description": "Have you ever had one of those one night stands after hooking up with someone with use of these popular dating apps? There is nothing wrong at finding a guy with a giant cock for tonight and fucking his tight ass without any obligations - in times of fuck buddies and all of these sexual deals, you could indeed do everything you want if you are good-looking enough. On VR Bangers Gay you do not even needs the looks, as our gay VR porn scenes are made for you and your pleasure only - our professional gay VR porn performers will always be ready to do whatever it takes to give you everything you need, and they will be always waiting for you out here for a yet another sexy date... and everything that comes after it. In the One Night Stand gay VR porn scene, not one but two of our amazing gay VR porn pros - Darius Ferdynand and Logan Moore - have been prepared to accommodate you within the comfortable walls of VRBangers.com, asking each other’s for a date that you too could be a part of. In this latest VR porn video, the guys have just met themselves and are having their first date today, but since they know that you are watching them with use of your VR goggles, they will skip the pleasantries and go straight to the business - meaning fucking each other’s tight asses and sucking on their dicks as deep as they only could. You will be able to watch all of that and much, much more, only moments after wearing your VR headset - join these two super-handsome dudes in their newest 4K ultra high definition gay VR porn video to have the sexiest gay VR porn date in your entire life in our 3D 360 degrees virtual reality!",
      "Pornstars": [
        "Logan Moore",
        "Darius Ferdynand"
      ],
      "Tags": [
        "Big Dick",
        "Blowjob",
        "Outdoor",
        "Hunk",
        "Bareback",
        "Muscle",
        "Cumshot",
        "Manscaping"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/one-night-stand/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/one-night-stand/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2019/05/One_Night_Stand_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2019/05/One_Night_poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2019/05/Match_vrbgay-2.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2019/05/Match_vrbgay-3.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2019/05/Match_vrbgay-4.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2019/05/Match_vrbgay-5.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2019/05/Match_vrbgay-6.jpg",
        "Image6": "https://cdn.vrbgay.com/wp-content/uploads/2019/05/Match_vrbgay-1.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_one_night_stand/VRBGAY_one_night_stand_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_one_night_stand/VRBGAY_one_night_stand_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_one_night_stand/VRBGAY_one_night_stand_trailer_4K_180x180_3dh.mp4"
      },
      "Release_Date": "2019-05-02 01:10:03"
    },
    {
      "Scene_ID": 394,
      "Title": "Paranormal Activity",
      "Full_Length": 1830,
      "Description": "Have you ever played with one of those Ouija boards? You know, these tablets that are used in horror movies to summon all kinds of devils, ghosts and poltergeists and to talk with the spirits of the dead... Sometimes it is better to leave such things untouched and remain preservative when it comes to these activities, but in other hand... human curiosity knows no limits and looking for new experiences is a natural part of our lives. Who knows, maybe you have reached the VRBGay.com for the first time out of eagerness and you started watching our premium gay VR porn movies since you were curious about all these huge cocks and handsome males...? To once again satisfy your interest and give you something that you have probably never seen before, we would like to introduce our latest spooky gay VR porn scene to you - Paranormal Activity gay VR porn video has just arrived the VR Bangers Gay’s website. Inside of this gay virtual reality porn scene, two of our hottest gay VR porn performers - amazingly handsome Nick Vargas and equally alluring Ryan Cage - will try to summon some ghosts with use of the Ouija board and you will get to watch the entire ritual of these two sexy hunks. Will the guys be able to summon a ghost and achieve contact with another world? We will leave that question unexplained and devise this latest gay VR porn scene of ours with a little bit of a mystery for you to discover - after all, you are here because of your soul of the explorer and it would have been stupid to lay all our cards on the table just like that, right? Wear your VR headset and see what VR Bangers Gay have prepared to surprise (and get you hard) this time!",
      "Pornstars": [
        "Ryan Cage"
      ],
      "Tags": [
        "Blowjob",
        "Hunk",
        "Tattoos",
        "Bareback",
        "Muscle",
        "Daddy"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/paranormal-activity/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/paranormal-activity/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2019/05/Paranormal_Activity_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2019/05/Paranormal_Activity_poster-1.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2019/05/Naughty_Spirit_vrbgay-1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2019/05/Naughty_Spirit_vrbgay-2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2019/05/Naughty_Spirit_vrbgay-3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2019/05/Naughty_Spirit_vrbgay-4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2019/05/Naughty_Spirit_vrbgay-5.jpg",
        "Image6": "https://cdn.vrbgay.com/wp-content/uploads/2019/05/Naughty_Spirit_vrbgay-6.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_paranormal_activity/VRBGAY_paranormal_activity_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_paranormal_activity/VRBGAY_paranormal_activity_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_paranormal_activity/VRBGAY_paranormal_activity_trailer_4K_180x180_3dh.mp4"
      },
      "Release_Date": "2019-05-16 01:10:02"
    },
    {
      "Scene_ID": 400,
      "Title": "A Helpful Hand",
      "Full_Length": 1492,
      "Description": "When was the last time when you had to move out and grab all these heavy furniture to your new place? If it was relatively not too long ago, then you have to remember how problematic these things can get - and especially if you are not getting any help from a strong friend of yours that could make this entire procedure a whole lot of less troublesome. In our latest gay VR porn video called A Helpful Hand, Logan Moore will give such help to Angel Cruz - and thus our two handsome gay VR porn stars will deal with the moving out so rapidly, that they will get a whole lot of time for some other... activities. In this brand new gay VR porn movie, these two amazingly hot gay VR porn performers will be more than happy to be left in the same room on their own - and your company in that little meeting of theirs will not ruin the atmosphere between them, and will - on the contrary - push them to be more daring and open minded. Thanks to all of that flexing of muscles when repositioning the furniture, the guys will get rather horny and in the mood for each other’s cocks - and if you would like to add your dick to this equation, wear your VR headset and do that straight away, as we truly encourage you to join that little gay VR porn meeting. With two great gay VR porn stars playing with each other’s bodies, your assistance will be well greeted and appreciated - our immersive gay virtual reality porn experiences are always being made when having your pleasure in mind, and so today our two badass hunks will not rest until giving you that well-deserved satisfaction that has been ensured to you after joining to the family of VR Bangers Gay!",
      "Pornstars": [
        "Logan Moore",
        "Angel Cruz"
      ],
      "Tags": [
        "Big Dick",
        "Blowjob",
        "Tattoos",
        "Bareback",
        "Latino",
        "Cumshot"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/a-helpful-hand/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/a-helpful-hand/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2019/05/A_Helpful_Hand_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2019/05/A_Helpful_Hand_poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2019/05/The_hot_move_vrbgay-1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2019/05/The_hot_move_vrbgay-4.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2019/05/The_hot_move_vrbgay-5.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2019/05/The_hot_move_vrbgay-6.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_a_helpful_hand/VRBGAY_a_helpful_hand_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_a_helpful_hand/VRBGAY_a_helpful_hand_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_a_helpful_hand/VRBGAY_a_helpful_hand_trailer_4K_180x180_3dh.mp4"
      },
      "Release_Date": "2019-05-30 01:10:03"
    },
    {
      "Scene_ID": 406,
      "Title": "Feeding Frenzy",
      "Full_Length": 2126,
      "Description": "Hungry for something tasty, or maybe you just want to skip the dinner and go straight to the dessert and eat a dick of one of our professional gay VR porn stars? In our latest gay VR porn movie called the Feeding Frenzy, you will get an opportunity to not only eat something in the company of a handsome gay VR porn twink, but also enjoy all the pleasures of the post-date activities - meaning fucking a tight ass and getting your dick sucked balls deep by a professional cock sucker that can’t wait to eat your schlong and make it all wet with his saliva. Ken Summers, as we have been talking about this young and talented gay VR porn star this entire time, is a Latino gay VR porn performer who is a shining star of this latest gay virtual reality porn fantasy - whether you have heard this name in the past or not, after watching this gay VR porn experience from its beginning to its end, we expect you to become one of his fans and we will not be surprised if you will ask for even more of his dick straight away. And you know what? He will be more than happy to give it to you as he is now officially one of the hot boys of the VR Bangers Gay’s family - wear your VR headset and join him both in the Feeding Frenzy gay VR porn movie and in other gay virtual reality experiences that Ken has starred in and satisfy your hunger for this handsome model as soon as possible! Food related gay VR porn scenes are always getting a little bit dirty, but we are sure that you do not mind that and will be able to simply focus on Mr. Summers’ performing to get the most of this gay VR porn display!",
      "Pornstars": [
        "Ken Summers"
      ],
      "Tags": [
        "Blowjob",
        "Hunk",
        "Twink",
        "Tattoos",
        "Bareback",
        "Latino",
        "Cumshot"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/feeding-frenzy/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/feeding-frenzy/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2019/06/Feeding_Frenzy_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2019/06/Feeding_Frenzy_poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2019/06/Feed_the_macho_vrbgay-1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2019/06/Feed_the_macho_vrbgay-2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2019/06/Feed_the_macho_vrbgay-3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2019/06/Feed_the_macho_vrbgay-4.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_feeding_frenzy/VRBGAY_feeding_frenzy_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_feeding_frenzy/VRBGAY_feeding_frenzy_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_feeding_frenzy/VRBGAY_feeding_frenzy_trailer_4K_180x180_3dh.mp4"
      },
      "Release_Date": "2019-06-13 01:10:02"
    },
    {
      "Scene_ID": 412,
      "Title": "69-pack",
      "Full_Length": 1589,
      "Description": "Have you ever wondered what is so special about gay VR porn videos that you keep on coming back to them and you like to watch them in your free time almost every other day? Apart from some sexual skills out of this world represented by our world-famous gay VR porn performers, all these talented gay VR porn stars have one more thing in common - they are (more or less) incredibly handsome and good-looking. Although, if you are thinking about a guy from your dreams that you would love to suck your cock, pretty face is not the most important thing in his looks... right? Sure, a charming smile could be really nice, but a muscular body making the guy similar to a Greek God is probably one of the most turning on things of all - and, do not worry, we - your favorite premium gay VR porn movies’ makers - are well aware of that! That is why we gave birth to our latest gay VR porn scene with not one but two buffed dudes - Esteban Mounty and Stephan Raw - the 69-pack gay VR porn video is all about the appreciation to beautiful male pecs and we made sure that our virtual reality porn camera has been well set-up and focused on them within this gay VR porn fantasy. Since this gay VR porn film has been produced in 4K ultra high definition, wearing your VR headset will get you as close to all these handsome bodies as possible and you will be able to focus all your attention on all these muscles flexing right in front of your face - get it done and don your VR goggles as soon as possible to enjoy this amazing opportunity with two of the most handsome gay VR porn stars in our huge family of spectacular gay performers!",
      "Pornstars": [
        "Esteban Mounty"
      ],
      "Tags": [
        "Big Dick",
        "Blowjob",
        "Tattoos",
        "Muscle",
        "Daddy",
        "Bear",
        "Cumshot"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/69-pack/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/69-pack/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2019/06/69-Pack_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2019/06/69-Pack_poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2019/06/Pecs_lover_vrbgay-1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2019/06/Pecs_lover_vrbgay-2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2019/06/Pecs_lover_vrbgay-3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2019/06/Pecs_lover_vrbgay-4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2019/06/Pecs_lover_vrbgay-6.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_69pack/VRBGAY_69pack_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_69pack/VRBGAY_69pack_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_69pack/VRBGAY_69pack_trailer_4K_180x180_3dh.mp4"
      },
      "Release_Date": "2019-06-27 01:10:03"
    },
    {
      "Scene_ID": 418,
      "Title": "SEX-boyfriend",
      "Full_Length": 1676,
      "Description": "Okay, listen up and tell us if this situation sounds familiar to you: You are dating a handsome guy and you too are getting along with each other... for most of the time. Eventually, something fucks up and you break up. The guy is pissed at you a lot, and you can’t stand each other’s company anymore - yet you meet again. You hate yourself but you miss your sexual past and, especially him, would do anything to play with your enormous dick one more time. So eventually... you fuck one last time - but, and that is the point of this entire story, not in a way that you used to, but while having an extremely aggressive and angry sex... Does that all sound familiar to you? No? Then wear your VR headset and experience that situation in our newest immersive gay VR porn video called SEX-boyfriend! We have just told you the forecast of the adventure that you are about to have in this awesome gay virtual reality porn scene - yet with only difference that it will not be just any angry boyfriend, but a professional gay VR porn star, Antonio Miracle, and you will be able to fuck his ass after impersonating a yet another handsome VR porn hunk - Jessy Ares. These two guys just can’t stand each other’s company anymore and they were super happy to shoot that all-angry VR porn video - and now, since it has been recorded with our sophisticated virtual reality porn camera, you can watch it in 4K ultra high definition VR! VR Bangers Gay made sure that both guys showed their >>qualities<< in the best possible way, so after diving inside of this VR porn experience with your VR goggles on, you will be able to almost feel like being in the same room with them and watch their cocks and tight asses from every angle and in super high resolution!",
      "Pornstars": [
        "Antonio Miracle"
      ],
      "Tags": [
        "Big Dick",
        "Blowjob",
        "Tattoos",
        "Muscle",
        "Cumshot"
      ],
      "FOV": [
        "180"
      ],
      "POV": "MALE",
      "Video_URL": "https://vrbgay.com/video/sex-boyfriend/",
      "Embed": "<iframe width='848' height='477' src='https://vrbgay.com/video/sex-boyfriend/?embed' frameborder='0'></iframe>",
      "Cover": "https://cdn.vrbgay.com/wp-content/uploads/2019/07/SEX-boyfriend_box_cover.jpg",
      "Poster": "https://cdn.vrbgay.com/wp-content/uploads/2019/07/SEX-boyfriend-poster.jpg",
      "Images": {
        "Image1": "https://cdn.vrbgay.com/wp-content/uploads/2019/07/Angry_ex_boyfriend_vrbgay-1.jpg",
        "Image2": "https://cdn.vrbgay.com/wp-content/uploads/2019/07/Angry_ex_boyfriend_vrbgay-2.jpg",
        "Image3": "https://cdn.vrbgay.com/wp-content/uploads/2019/07/Angry_ex_boyfriend_vrbgay-3.jpg",
        "Image4": "https://cdn.vrbgay.com/wp-content/uploads/2019/07/Angry_ex_boyfriend_vrbgay-4.jpg",
        "Image5": "https://cdn.vrbgay.com/wp-content/uploads/2019/07/Angry_ex_boyfriend_vrbgay-5.jpg",
        "Image6": "https://cdn.vrbgay.com/wp-content/uploads/2019/07/Angry_ex_boyfriend_vrbgay-6.jpg"
      },
      "Trailers": {
        "180_HQ": "https:https://mov.vrbgay.com/vrbgay_sexboyfriend/VRBGAY_sexboyfriend_trailer_HQ_180x180_3dh.mp4",
        "180_HD": "https:https://mov.vrbgay.com/vrbgay_sexboyfriend/VRBGAY_sexboyfriend_trailer_HD_180x180_3dh.mp4",
        "180_4K": "https:https://mov.vrbgay.com/vrbgay_sexboyfriend/VRBGAY_sexboyfriend_trailer_4K_180x180_3dh.mp4"
      },
      "Release_Date": "2019-07-11 01:10:03"
    }
  ]